app/controllers/equipment_controller.rb

SELECT * FROM `equipment_listings` WHERE (TRUE) ORDER BY serial_no ASC LIMIT 0, 3
SELECT count(*) AS count_all FROM `equipment_listings` WHERE (TRUE)
---
  def index
    @can_create = action_permitted?(params[:controller], 'new')

    query = "TRUE"
    query += [" and serial_no LIKE ", "'%" + sanitize_search(params[:serial_no]) + "%'"].to_s unless params[:serial_no].blank?
    query += [" and display_name LIKE ", "'%" + sanitize_search(params[:seat_no]) + "%'"].to_s unless params[:seat_no].blank?
    query += " and eq_condition =  \"#{sanitize_search(params[:condition])}\"" unless params[:condition].blank?
    query += [" and hardware_address LIKE ", "'%" + sanitize_search(params[:hardware_address]) + "%'"].to_s unless params[:hardware_address].blank?
    query += [" and description LIKE ", "'%" + sanitize_search(params[:description]) + "%'"].to_s unless params[:description].blank?

    @sort = params[:sort] || 'serial_no ASC'
    @equipment = EquipmentListing.paginate :page => params[:page], :order => @sort, :conditions => query

SELECT * FROM `equipment` WHERE (`equipment`.`id` = 2)
---
  def show
    @equipment = Equipment.find(params[:id])

SELECT * FROM `equipment` WHERE (`equipment`.`id` = 2)
---
  def change_condition
    @equipment = Equipment.find(params[:id])

SELECT * FROM `equipment` WHERE (`equipment`.`id` = 2)
---
  def condition_history
    @equipment = Equipment.find(params[:id])

SELECT * FROM `equipment` WHERE (`equipment`.`id` = 2)
---
  def seat_history
    @equipment = Equipment.find(params[:id])

SELECT * FROM `equipment` WHERE (`equipment`.`id` = 2)
---
  def edit
    @equipment = Equipment.find(params[:id])