app/controllers/groups_controller.rb

  def update
    @group = Group.find(params[:id])

    # get an array of roles and set the role associations
    params[:group][:roles] = [] if params[:group][:roles].nil?
    roles = params[:group][:roles].collect { |i| Role.find(i) }
    @group.roles = roles

    # set parent manually
    if params[:group][:parent].to_s.empty?
      @group.parent = nil
    else
      @group.parent = Group.find(params[:group][:parent])
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 3)
SELECT * FROM `roles` WHERE (`roles`.`id` = 3)
SELECT * FROM `roles` INNER JOIN `groups_roles` ON `roles`.id = `groups_roles`.role_id WHERE (`groups_roles`.group_id = 2 )