app/controllers/help_requests_controller.rb

SELECT * FROM `help_request_listings` WHERE (TRUE) ORDER BY created_at DESC LIMIT 0, 3
SELECT count(*) AS count_all FROM `help_request_listings` WHERE (TRUE)
---
  def index
    query = "TRUE"
    query += [" and id LIKE ", "'%" + sanitize_search(params[:help_id]) + "%'"].to_s unless params[:help_id].blank?
    query += [" and display_name LIKE ", "'%" + sanitize_search(params[:seat_no]) + "%'"].to_s unless params[:seat_no].blank?
    query += [" and hardware_address LIKE ", "'%" + sanitize_search(params[:hardware_address]) + "%'"].to_s unless params[:hardware_address].blank?
    query += [" and request_remark LIKE ", "'%" + sanitize_search(params[:request_remark]) + "%'"].to_s unless params[:request_remark].blank?
    query += " and status =  \"#{sanitize_search(params[:status])}\"" unless params[:status].blank?
    query += [" and created_at LIKE ", "'%" + sanitize_search(params[:date_from]) + "%'"].to_s unless params[:date_from].blank?

    @sort = params[:sort] || 'created_at DESC'
    @help_requests = HelpRequestListing.paginate :page => params[:page], :order => @sort, :conditions => query