app/controllers/permissions_controller.rb

  def index
    @permissions = Permission.paginate :page => params[:page], :order => 'controller_name, action_name'
---
SELECT * FROM `permissions` ORDER BY controller_name, action_name LIMIT 0, 40
SELECT count(*) AS count_all FROM `permissions`

  def edit
    @permission = Permission.find(params[:id])
---
SELECT * FROM `permissions` WHERE (`permissions`.`id` = 45)