app/controllers/preferences_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def my_account
    @account = User.find_by_id(session[:user])

SELECT * FROM `system_parameters` WHERE (`system_parameters`.`name` = 'paginator') LIMIT 1
---
  def paginator
    @paginator = SystemParameter.find_by_name("paginator")

SELECT * FROM `system_parameters` LIMIT 0, 30
---
  def list
    @can_create = action_permitted?(params[:controller], 'new')
    @system_parameters = SystemParameter.paginate :page => params[:page]

SELECT * FROM `system_parameters` WHERE (`system_parameters`.`id` = 1)
---
  def edit
    @system_parameter = SystemParameter.find(params[:id])