app/controllers/roles_controller.rb

  def index
    @roles = Role.find(:all, :order => "title")
---
SELECT * FROM `roles` WHERE (`roles`.parent_id = 3) ORDER BY title

  def edit
    @role = Role.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.parent_id = 3) ORDER BY title