app/controllers/seats_controller.rb

SELECT * FROM `seat_listings` WHERE (TRUE) ORDER BY display_name ASC LIMIT 0, 3
SELECT count(*) AS count_all FROM `seat_listings` WHERE (TRUE)
---
  def index
    @can_create = action_permitted?(params[:controller], 'new')

    query = "TRUE"
    query += [" and display_name LIKE ", "'%" + sanitize_search(params[:display_name]) + "%'"].to_s unless params[:display_name].blank?
    query += [" and user_name LIKE ", "'%" + sanitize_search(params[:user_name]) + "%'"].to_s unless params[:user_name].blank?
    query += [" and full_name LIKE ", "'%" + sanitize_search(params[:full_name]) + "%'"].to_s unless params[:full_name].blank?
    query += " and duration =  \"#{sanitize_search(params[:duration]).minute}\"" unless params[:duration].blank?
    query += " and status =  \"#{sanitize_search(params[:status])}\"" unless params[:status].blank?
    query += " and st_condition =  \"#{sanitize_search(params[:condition])}\"" unless params[:condition].blank?

    @sort = params[:sort] || 'display_name ASC'
    @seats = SeatListing.paginate :page => params[:page], :order => @sort, :conditions => query

SELECT * FROM `seats` WHERE (`seats`.`id` = 1)
---
  def show
    @seat = Seat.find(params[:id])

SELECT * FROM `seats` WHERE (`seats`.`id` = 1)
---
  def condition_history
    @seat = Seat.find(params[:id])

SELECT * FROM `seats` WHERE (`seats`.`id` = 1)
---
  def edit
    @seat = Seat.find(params[:id])