app/controllers/sessions_controller.rb

  def create
    unless params[:login].blank? or params[:password].blank?
      self.current_user = User.authenticate(params[:login], params[:password])
      login_name = self.current_user.login_name if logged_in?
      if logged_in? and self.current_user.groups.empty?
---
SELECT * FROM `groups` INNER JOIN `groups_users` ON `groups`.id = `groups_users`.group_id WHERE (`groups_users`.user_id = 1 )
SELECT * FROM `users` WHERE (`users`.`login_name` = 'root') LIMIT 1