app/controllers/users_controller.rb

SELECT * FROM `user_listings` WHERE (login_name != 'root' AND login_name != 'administrator') ORDER BY login_name LIMIT 0, 3
SELECT count(*) AS count_all FROM `user_listings` WHERE (login_name != 'root' AND login_name != 'administrator')
---
  def index
    @can_create = action_permitted?(params[:controller], 'new')

    query = ""
    query += [" and login_name LIKE ", "'%" + sanitize_search(params[:login_name]) + "%'"].to_s unless params[:login_name].blank?
    query += [" and full_name LIKE ", "'%" + sanitize_search(params[:full_name]) + "%'"].to_s unless params[:full_name].blank?
    query += " and nature =  \"#{sanitize_search(params[:nature])}\"" unless params[:nature].blank?
    query += " and status =  \"#{sanitize_search(params[:status])}\"" unless params[:status].blank?
    query += " and ml_access_status =  \"#{sanitize_search(params[:ml_status])}\"" unless params[:ml_status].blank?
    if not params[:date_from].blank? and not params[:date_to].blank?
      query += " and verification_time BETWEEN \"#{sanitize_search(params[:date_from])}\" AND \"#{sanitize_search(params[:date_to])}\""
    elsif not params[:date_from].blank?
      query += [" and verification_time LIKE ", "'%" + sanitize_search(params[:date_from]) + "%'"].to_s
    end

    if current_user.has_role?("Root")
      user_check = "1=1"
    else
      user_check = "login_name != 'root' AND login_name != 'administrator'"
    end

    @sort = params[:sort] || 'login_name'
    @users = UserListing.paginate :page => params[:page], :conditions => user_check + query, :order => @sort

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def access_history
    @user = User.find(params[:id])